notes/topics.org
* topics
**  raku study group topics
*** collected from previous meeting notes
***  delete these once they're covered

** techid: database with categorization features, links to meeting notes

** subjects
*** nested map idioms
**** TODO nested map: review perl5 approaches 
***** maybe, try python version
**** TODO nested map: get some raku code working 
***** /home/doom/End/Cave/Perl6/Wall/raku-study/bin/2021mar21/nested_map.raku
*** quoted string regexes
**** TODO re_quoted_str: perl5 versions 
**** TODO re_quoted_str: continue with raku versions
***** next: balanced quotes of various types
****** yary hluchan
******** https://github.com/doomvox/raku-study/blob/main/notes/bin/richard_hainsworth_grammar.raku
******** /home/doom/End/Cave/Perl6/Wall/raku-study/bin/richard_hainsworth_grammar.raku

****** moritz lenz 
******** https://github.com/doomvox/raku-study/blob/main/notes/bin/2021mar21/parsing_quoted_strings_backslash.raku
******** /home/doom/End/Cave/Perl6/Wall/raku-study/bin/2021mar21/parsing_quoted_strings_backslash.raku

*** a stupid mistake that isn't: naming a method with a leading ^
**** https://stackoverflow.com/questions/54143036/class-method-name-with-doesnt-get-invoked-properly/54147131#54147131
***** should this generate a warning/error?

*** Steven Lembark
**** https://www.slideshare.net/lembark/hypers-and-gathers-and-takes-oh-my
***** slide21:  "unit sub MAIN { ..."  unit?
**** https://www.slideshare.net/lembark/generating-querying-calendar-tables-in-posgresql
*** adverbs that control returns, e.g. :p for pairs (a feature Bruce Gray likes)
**** https://docs.raku.org/language/subscripts#index-entry-:p_(subscript_adverb)
*** andrew shitov "Perl 6 at a Glance"
**** https://andrewshitov.com/perl6-at-a-glance/
**** https://andrewshitov.com/wp-content/uploads/2020/01/Perl-6-at-a-Glance.pdf

*** andrew shitov's raku course on-line:
https://course.raku.org/

*** perl weekly challenge: 
**** https://perlweeklychallenge.org/

*** promises and threads
**** https://www.reddit.com/r/rakulang/comments/lthpxe/are_promises_multithreaded/
**** Jonathan Worthington
***** https://github.com/Raku/CCR/blob/main/Remaster/Jonathan%20Worthington/Racing-to-writeness-to-wrongness-leads.md
***** https://github.com/Raku/CCR/blob/main/Remaster/Jonathan%20Worthington/A-unified-and-improved-Supply-concurrency-model.md


*** other files to go through

  -rw-r--r--  1 doom doom  1888 Feb 14 17:07 meeting_2020dec20.org
  -rw-r--r--  1 doom doom  3606 Feb 13 22:15 meeting_2021feb07.org
  -rw-r--r--  1 doom doom  3803 Feb  7 14:02 meeting_2021jan31.org
  -rw-r--r--  1 doom doom  2519 Jan 24 20:45 meeting_2021jan24.org
  -rw-r--r--  1 doom doom  1940 Jan 18 13:17 meeting_2020jan17.org
  -rw-r--r--  1 doom doom  1505 Jan 12 11:52 meeting_2020jan10.org
  -rw-r--r--  1 doom doom  2158 Dec 19 17:17 meeting_2020dec13.org
  -rw-r--r--  1 doom doom  2146 Dec  7 13:23 meeting_2020dec06.org
