notes/topics.md
- [topics](#orgcf95378)
  - [raku study group topics](#orgfc9b730)
    - [collected from previous meeting notes](#orgcb5d3f5)
    - [delete these once they're covered](#org0a4ede6)
  - [techid: database with categorization features, links to meeting notes](#org0dbeb5b)
  - [subjects](#org343289c)
    - [nested map idioms](#org60b61bb)
    - [quoted string regexes](#orgf18e23c)
    - [a stupid mistake that isn't: naming a method with a leading ^](#org234be09)
    - [Steven Lembark](#orgc26bcaa)
    - [adverbs that control returns, e.g. :p for pairs (a feature Bruce Gray likes)](#org6f8e5b0)
    - [andrew shitov "Perl 6 at a Glance"](#orgb621d5a)
    - [andrew shitov's raku course on-line:](#orge38ed79)
    - [perl weekly challenge:](#org33f660b)
    - [promises and threads](#orgd0d5b7d)
    - [other files to go through](#org5495862)


<a id="orgcf95378"></a>

# topics


<a id="orgfc9b730"></a>

## raku study group topics


<a id="orgcb5d3f5"></a>

### collected from previous meeting notes


<a id="org0a4ede6"></a>

### delete these once they're covered


<a id="org0dbeb5b"></a>

## techid: database with categorization features, links to meeting notes


<a id="org343289c"></a>

## subjects


<a id="org60b61bb"></a>

### nested map idioms

1.  TODO nested map: review perl5 approaches

    1.  maybe, try python version

2.  TODO nested map: get some raku code working

    1.  /home/doom/End/Cave/Perl6/Wall/raku-study/bin/2021mar21/nested<sub>map.raku</sub>


<a id="orgf18e23c"></a>

### quoted string regexes

1.  TODO re<sub>quoted</sub><sub>str</sub>: perl5 versions

2.  TODO re<sub>quoted</sub><sub>str</sub>: continue with raku versions

    1.  next: balanced quotes of various types
    
        1.  yary hluchan
        
            1.  <https://github.com/doomvox/raku-study/blob/main/notes/bin/richard_hainsworth_grammar.raku>
            
            2.  /home/doom/End/Cave/Perl6/Wall/raku-study/bin/richard<sub>hainsworth</sub><sub>grammar.raku</sub>
        
        2.  moritz lenz
        
            1.  <https://github.com/doomvox/raku-study/blob/main/notes/bin/2021mar21/parsing_quoted_strings_backslash.raku>
            
            2.  /home/doom/End/Cave/Perl6/Wall/raku-study/bin/2021mar21/parsing<sub>quoted</sub><sub>strings</sub><sub>backslash.raku</sub>


<a id="org234be09"></a>

### a stupid mistake that isn't: naming a method with a leading ^

1.  <https://stackoverflow.com/questions/54143036/class-method-name-with-doesnt-get-invoked-properly/54147131#54147131>

    1.  should this generate a warning/error?


<a id="orgc26bcaa"></a>

### Steven Lembark

1.  <https://www.slideshare.net/lembark/hypers-and-gathers-and-takes-oh-my>

    1.  slide21:  "unit sub MAIN { &#x2026;"  unit?

2.  <https://www.slideshare.net/lembark/generating-querying-calendar-tables-in-posgresql>


<a id="org6f8e5b0"></a>

### adverbs that control returns, e.g. :p for pairs (a feature Bruce Gray likes)

1.  <https://docs.raku.org/language/subscripts#index-entry-:p_(subscript_adverb)>


<a id="orgb621d5a"></a>

### andrew shitov "Perl 6 at a Glance"

1.  <https://andrewshitov.com/perl6-at-a-glance/>

2.  <https://andrewshitov.com/wp-content/uploads/2020/01/Perl-6-at-a-Glance.pdf>


<a id="orge38ed79"></a>

### andrew shitov's raku course on-line:

<https://course.raku.org/>


<a id="org33f660b"></a>

### perl weekly challenge:

1.  <https://perlweeklychallenge.org/>


<a id="orgd0d5b7d"></a>

### promises and threads

1.  <https://www.reddit.com/r/rakulang/comments/lthpxe/are_promises_multithreaded/>

2.  Jonathan Worthington

    1.  <https://github.com/Raku/CCR/blob/main/Remaster/Jonathan%20Worthington/Racing-to-writeness-to-wrongness-leads.md>
    
    2.  <https://github.com/Raku/CCR/blob/main/Remaster/Jonathan%20Worthington/A-unified-and-improved-Supply-concurrency-model.md>


<a id="org5495862"></a>

### other files to go through

-rw-r&#x2013;r&#x2013; 1 doom doom 1888 Feb 14 17:07 meeting<sub>2020dec20.org</sub> -rw-r&#x2013;r&#x2013; 1 doom doom 3606 Feb 13 22:15 meeting<sub>2021feb07.org</sub> -rw-r&#x2013;r&#x2013; 1 doom doom 3803 Feb 7 14:02 meeting<sub>2021jan31.org</sub> -rw-r&#x2013;r&#x2013; 1 doom doom 2519 Jan 24 20:45 meeting<sub>2021jan24.org</sub> -rw-r&#x2013;r&#x2013; 1 doom doom 1940 Jan 18 13:17 meeting<sub>2020jan17.org</sub> -rw-r&#x2013;r&#x2013; 1 doom doom 1505 Jan 12 11:52 meeting<sub>2020jan10.org</sub> -rw-r&#x2013;r&#x2013; 1 doom doom 2158 Dec 19 17:17 meeting<sub>2020dec13.org</sub> -rw-r&#x2013;r&#x2013; 1 doom doom 2146 Dec 7 13:23 meeting<sub>2020dec06.org</sub>
